{

  "headerContent": {
    "navbarRoutes": [
      {
        "text": "Home",
        "path": "/"
      },
      {
        "text": "About Me",
        "path": "/about"
      },
      {
        "text": "Skills",
        "path": "/skills"
      },
      {
        "text": "Projects",
        "path": "/projects"
      }
    ]
  },
  "homePageContent": {
    "firstHeading": "Hello Everyone!",
    "secondHeading": "I'm Stefano Biddau",
    "thirdHeading": [
      "Frontend Developer",
      "Web Designer",
      "Backend Developer"
    ],
    "firstButton": {
      "text": "Contact me",
      "link": "https://www.linkedin.com/in/stefano-biddau-669149214/"
    },
    "secondButton": {
      "text": "Download my CV",
      "link": "/docs/Stefano-Biddau-CV.pdf"
    }
  },

  "aboutMePageContent": {
    "pageHeading": "Who am I?",
    "bioSections": [
      {
        "titleHeading": "From Foundations to Frontier",
        "subTitleHeading": "My Journey in Computer Science",
        "contentParagraph": "My passion for computer science and development found solid roots during my educational years, starting with my studies at the P.E. Imbriani State High School in Avellino, Italy, where I graduated in July 2018. Opting for Applied Sciences was a pivotal decision, as it allowed me to deeply explore mathematics, physics, and biology—subjects that honed my analytical thinking and problem-solving abilities. This preparation laid the groundwork for my subsequent university experience at the University of Salerno in Fisciano, where I earned a Bachelor’s Degree in Computer Science in December 2022. During my university journey, I had the opportunity to fully immerse myself in the field of computer science, tackling in-depth studies on programming, algorithms, operating systems, and artificial intelligence. These studies not only reinforced my passion but also broadened my perspective on the capabilities of software development and how technology can be used to improve everyday life. The combination of theory and practice, through projects and laboratories, was crucial in developing my technical skills and the ability to practically apply the knowledge acquired. Choosing to pursue this career was a natural evolution of my interest and curiosity towards the digital world, pushing me to continuously explore and innovate in this dynamic and ever-evolving field.",
        "imagePath": "/images/graduation-img.jpg",
        "imageDescription": "During the exposition of my graduation thesis (December 15, 2023)"
      },

      {
        "titleHeading": "Navigating between Stack",
        "subTitleHeading": "From Internship to Full-Stack Development",
        "contentParagraph":"My professional journey in computer science began with an internship at SI2001 in Battipaglia, Campania, which lasted from November 2022 to February 2023. During this period, I acquired skills in developing distributed applications, mastering both back-end and front-end technologies. This experience allowed me to utilize modern and highly demanded technologies in the market, refining my technical abilities in a stimulating and dynamic environment. Upon completing my internship, I was hired as a Full-Stack Developer by the same company in March 2023, a role I continue to hold today. Transitioning from an intern to a full member of the development team gave me the opportunity to further deepen my knowledge and technical skills, working on more complex and challenging projects. Although the role of a full-stack developer requires good versatility across different technologies and frameworks, my passion and main goal remain focused on front-end development. I am continually seeking opportunities to excel in this area, convinced that the user interface is not just a matter of aesthetics but a crucial point of contact that defines the end-user experience. My aspiration is to become a reference point in the field of front-end, bringing continuous innovation and improvements to the projects I work on. In this journey, my passion for computer science continues to guide me towards new challenges and achievements, with the goal of excelling in every aspect of my work while maintaining a clear focus on the specialization that most excites me.",
        "imagePath": "/images/work-img.jpg",
        "imageDescription": "My remote workstation (2023)" 
      }
    ]
  }
}
